# RbsCabletrayconduitConnectorelemType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsCabletrayconduitConnectorelemType Property
ParameterTypeId Class See Also
---
"Connector Type"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsCabletrayconduitConnectorelemType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsCabletrayconduitConnectorelemType As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsCabletrayconduitConnectorelemType {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace